# ДЗ №1. Вычисления с помощью библиотеки Numpy

## Задание 1

Импортируйте библиотеку Numpy и дайте ей псевдоним np.<br/>


Создайте массив Numpy под названием a размером 5x2,то есть состоящий из 5 строк и 2 столбцов.<br/> 
Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем 
считать,<br/> что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее 
значение по каждому<br/> признаку, используя метод mean массива Numpy.<br/><br/> Результат запишите 
в массив mean_a, в нем должно быть 2 элемента.

In [22]:
import numpy as np

In [8]:
a = np.array(
    [[1, 2, 3, 3, 1], 
    [6, 8, 11, 10, 7]]
).transpose()
print(a)

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]

In [9]:
mean_a = np.mean(a, axis = 0)
print(mean_a)

[2.  8.4]

## Задание 2

Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих признаков,<br/>  содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер 5x2.

In [10]:
a_centered = a - mean_a
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

## Задание 3

Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться<br/>
величина a_centered_sp. Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [19]:
yl=a_centered[:,0]
y2=a_centered[:,1]
a_centered_sp=np.dot(yl,y2)
a_centered_sp

8.0

In [29]:
N=a.shape[0]
N

5

In [30]:
my_cov = a_centered_sp/(N-1)
my_cov

2.0

## Задание 4**

Число, которое мы получили в конце задания 3 является ковариацией двух признаков,<br/>
содержащихся в массиве “а”. В задании 4 мы делили сумму произведений центрированных<br/> 
признаков на N-1, а не на N, поэтому полученная нами величина является несмещенной<br/> 
оценкой ковариации. <br/><br/>

Подробнее узнать о ковариации можно здесь:
https://studopedia.ru/9_153900_viborochnaya-kovariatsiya-i-viborochnaya-dispersiya.html<br/><br/>

В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом<br/> 
- с помощью функции np.cov.<br/> В качестве аргумента m функция np.cov должна принимать<br/> 
транспонированный массив “a”. В получившейся ковариационной матрице (массив Numpy размером 2x2)<br/> 
искомое значение ковариации будет равно элементу в строке с индексом 0 и столбце с индексом 1.

In [31]:
np.cov(a.transpose())

array([[1. , 2. ],
       [2. , 4.3]])

# ДЗ №2. Работа с данными в Pandas

## Задание 1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors<br/> 
со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3]<br/>
и ['Тургенев', 'Чехов', 'Островский']. Затем создайте датафрейм book cо столбцами author_id,<br/>
book_title и price, в которых соответственно содержатся данные: <br/><br/>
[1, 1, 1, 2, 2, 3, 3], 
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза',<br/>
 'Таланты и поклонники'], [450, 300, 350, 500, 450, 370, 290].

In [35]:
import pandas as pd

In [42]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 
                        'author_name':['Тургенев', 'Чехов', 'Островский']}, 
                       columns=['author_id', 'author_name'])
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [43]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 
                     'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
                     'price':[450, 300, 350, 500, 450, 370, 290]}, 
                    columns=['author_id', 'book_title', 'price'])
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

## Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [44]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

## Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [46]:
top5 = authors_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

## Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price.<br/>
В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price, <br/>
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [51]:
authors_stat = authors_price.groupby('author_name').agg({'price':['min', 'max', 'mean']})
authors_stat = authors_stat.rename(columns={'min':'min_price', 'max':'max_price', 'mean':'mean_price'})
authors_stat

                price
            min_price max_price  mean_price
author_name
Островский        290       370  330.000000
Тургенев          300       450  366.666667
Чехов             450       500  475.000000

## Задание 5

Создайте новый столбец в датафрейме authors_price под названием cover,<br/>
в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая.<br/> 
В этот столбец поместите данные из следующего списка:<br/>
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.<br/>
Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке.<br/> Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая"<br/>
и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей<br/> заполните нулями, при необходимости загрузите библиотеку Numpy. Назовите полученный<br/> датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем<br/> загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы<br/> book_info и book_info2 идентичны.

In [52]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [54]:
?pd.pivot_table

In [55]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'], 
                           columns=['cover'], aggfunc=np.sum, fill_value=0)
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [56]:
book_info.to_pickle('book_info.pkl')

In [57]:
book_info2 = pd.read_pickle('book_info.pkl')

In [58]:
book_info==book_info2

cover        мягкая  твердая
author_name
Островский     True     True
Тургенев       True     True
Чехов          True     True